## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 2 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     NAME                                     |
|----------|------------------------------------------------------------------------------|
| update   | `aws_secretsmanager_secret.manifest_redis_publish_url`                       |
|          | `aws_secretsmanager_secret.manifest_redis_url`                               |
| recreate | `aws_secretsmanager_secret.manifest_sqlalachemy_database_reader_uri`         |
|          | `aws_secretsmanager_secret.manifest_sqlalachemy_database_uri`                |
|          | `aws_secretsmanager_secret_version.manifest_postgres_host_version`           |
|          | `aws_secretsmanager_secret_version.manifest_redis_publish_url`               |
|          | `aws_secretsmanager_secret_version.manifest_redis_url`                       |
|          | `aws_secretsmanager_secret_version.manifest_sqlalachemy_database_reader_uri` |
|          | `aws_secretsmanager_secret_version.manifest_sqlalachemy_database_uri`        |
| add      | `aws_secretsmanager_secret.manifest_postgres_sql`                            |
|          | `aws_secretsmanager_secret_version.manifest_postgres_sql_version`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret.manifest_postgres_sql will be created
  + resource "aws_secretsmanager_secret" "manifest_postgres_sql" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "MANIFEST_POSTGRES_SQL"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret.manifest_redis_publish_url will be updated in-place
  ~ resource "aws_secretsmanager_secret" "manifest_redis_publish_url" {
        id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii"
        name                           = "MANIFEST_REDIS_PUBLISH_URL"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (7 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.manifest_redis_url will be updated in-place
  ~ resource "aws_secretsmanager_secret" "manifest_redis_url" {
        id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_URL-smYW5p"
        name                           = "MANIFEST_REDIS_URL"
      ~ recovery_window_in_days        = 30 -> 0
        tags                           = {}
        # (7 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.manifest_sqlalachemy_database_reader_uri must be replaced
-/+ resource "aws_secretsmanager_secret" "manifest_sqlalachemy_database_reader_uri" {
      ~ arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_READER_URI-vcs5aO" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_READER_URI-vcs5aO" -> (known after apply)
      ~ name                           = "SQLALCHEMY_DATABASE_READER_URI" -> "MANIFEST_SQLALCHEMY_DATABASE_READER_URI" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ replica {
          + arn                            = (known after apply)
          + description                    = (known after apply)
          + force_overwrite_replica_secret = (known after apply)
          + id                             = (known after apply)
          + kms_key_id                     = (known after apply)
          + name                           = (known after apply)
          + name_prefix                    = (known after apply)
          + policy                         = (known after apply)
          + recovery_window_in_days        = (known after apply)
          + tags                           = (known after apply)
          + tags_all                       = (known after apply)
        } -> (known after apply)
    }

  # aws_secretsmanager_secret.manifest_sqlalachemy_database_uri must be replaced
-/+ resource "aws_secretsmanager_secret" "manifest_sqlalachemy_database_uri" {
      ~ arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_URI-S6s9oh" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_URI-S6s9oh" -> (known after apply)
      ~ name                           = "SQLALCHEMY_DATABASE_URI" -> "MANIFEST_SQLALCHEMY_DATABASE_URI" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ replica {
          + arn                            = (known after apply)
          + description                    = (known after apply)
          + force_overwrite_replica_secret = (known after apply)
          + id                             = (known after apply)
          + kms_key_id                     = (known after apply)
          + name                           = (known after apply)
          + name_prefix                    = (known after apply)
          + policy                         = (known after apply)
          + recovery_window_in_days        = (known after apply)
          + tags                           = (known after apply)
          + tags_all                       = (known after apply)
        } -> (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_postgres_host_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_postgres_host_version" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_POSTGRES_HOST-smYW5p" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_POSTGRES_HOST-smYW5p|terraform-20241017192845837900000029" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241017192845837900000029" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.manifest_postgres_sql_version will be created
  + resource "aws_secretsmanager_secret_version" "manifest_postgres_sql_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.manifest_redis_publish_url must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_redis_publish_url" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii|terraform-20241017192846176400000046" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241017192846176400000046" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.manifest_redis_url must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_redis_url" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_URL-smYW5p" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_URL-smYW5p|terraform-20241017192845715100000027" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241017192845715100000027" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.manifest_sqlalachemy_database_reader_uri must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_sqlalachemy_database_reader_uri" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_READER_URI-vcs5aO" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_READER_URI-vcs5aO|terraform-20241017192845996300000035" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_READER_URI-vcs5aO" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "terraform-20241017192845996300000035" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.manifest_sqlalachemy_database_uri must be replaced
-/+ resource "aws_secretsmanager_secret_version" "manifest_sqlalachemy_database_uri" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_URI-S6s9oh" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_URI-S6s9oh|terraform-2024101719284602100000003c" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:SQLALCHEMY_DATABASE_URI-S6s9oh" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "terraform-2024101719284602100000003c" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 9 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_fresh_desk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_fresh_desk_product_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_gc_articles_api_auth_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_gc_articles_api_auth_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_mixpanel_project_token"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
